tiborsimon/embedded-tdd-headers/pic/pic16/pic16c662_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16C662_H_
#define _PIC16C662_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define RA5                           18
#define PORTB                         19
#define RB0                           20
#define RB1                           21
#define RB2                           22
#define RB3                           23
#define RB4                           24
#define RB5                           25
#define RB6                           26
#define RB7                           27
#define PORTC                         28
#define RC0                           29
#define RC1                           30
#define RC2                           31
#define RC3                           32
#define RC4                           33
#define RC5                           34
#define RC6                           35
#define RC7                           36
#define PORTD                         37
#define RD0                           38
#define RD1                           39
#define RD2                           40
#define RD3                           41
#define RD4                           42
#define RD5                           43
#define RD6                           44
#define RD7                           45
#define PORTE                         46
#define RE0                           47
#define RE1                           48
#define RE2                           49
#define INTCON                        50
#define RBIF                          51
#define INTF                          52
#define T0IF                          53
#define RBIE                          54
#define INTE                          55
#define T0IE                          56
#define PEIE                          57
#define GIE                           58
#define PIR1                          59
#define CMIF                          60
#define PSPIF                         61
#define CMCON                         62
#define CM                            63
#define CM0                           64
#define CM1                           65
#define CM2                           66
#define CIS                           67
#define C1OUT                         68
#define C2OUT                         69
#define OPTION_REG                    70
#define PS                            71
#define PS0                           72
#define PS1                           73
#define PS2                           74
#define PSA                           75
#define T0SE                          76
#define T0CS                          77
#define INTEDG                        78
#define nRBPU                         79
#define TRISA                         80
#define TRISA0                        81
#define TRISA1                        82
#define TRISA2                        83
#define TRISA3                        84
#define TRISA4                        85
#define TRISA5                        86
#define TRISB                         87
#define TRISB0                        88
#define TRISB1                        89
#define TRISB2                        90
#define TRISB3                        91
#define TRISB4                        92
#define TRISB5                        93
#define TRISB6                        94
#define TRISB7                        95
#define TRISC                         96
#define TRISC0                        97
#define TRISC1                        98
#define TRISC2                        99
#define TRISC3                        100
#define TRISC4                        101
#define TRISC5                        102
#define TRISC6                        103
#define TRISC7                        104
#define TRISD                         105
#define TRISD0                        106
#define TRISD1                        107
#define TRISD2                        108
#define TRISD3                        109
#define TRISD4                        110
#define TRISD5                        111
#define TRISD6                        112
#define TRISD7                        113
#define TRISE                         114
#define TRISE0                        115
#define TRISE1                        116
#define TRISE2                        117
#define PSPMODE                       118
#define IBOV                          119
#define OBF                           120
#define IBF                           121
#define PIE1                          122
#define CMIE                          123
#define PSPIE                         124
#define PCON                          125
#define nBO                           126
#define nBOR                          127
#define nPOR                          128
#define nPER                          129
#define MPEEN                         130
#define VRCON                         131
#define VR0                           132
#define VR                            133
#define VR1                           134
#define VR2                           135
#define VR3                           136
#define VRR                           137
#define VROE                          138
#define VREN                          139

#endif // _PIC16C662_H_
